import { KeyPlatformList } from "./mapPlatformList"


type SubtitleList = 'ซับไทย' | 'พากย์ไทย' |'พากย์ญี่ปุ่น'

export type AnimeObj = {
    season:string ;
    subtitleList: SubtitleList[] ;
    resume:string ;
    platformList:KeyPlatformList[];
}

export type TypeDataAnime = Record<number,AnimeObj> 


// For adding anime information as an example
export const AnimeData:TypeDataAnime = {
    52480:{ 
        season:'Season 2' ,
        subtitleList:[ 'ซับไทย','พากย์ไทย','พากย์ญี่ปุ่น' ] ,
        resume:'เรื่องย่อ: คิมิสึกะ คิมิฮิโกะ หนุ่มวัย 14 ปี ที่มักจะพัวพันกับคดีต่างๆ จนเกิดคดีปล้นเครื่องบินได้พบกับเซียสต้า หลังจากถูกชักชวน ตัวเขาได้เป็นผู้ช่วยของนักสืบสาว เซียสต้า ออกเดินทางกับเธอร่วม 3 ปีสู้กับองค์กรลับ SPES หลังจากเซียสต้าตายไปร่วม 1 ปีและกลับมาใช้ชีวิตเป็นนักเรียนมัธยมปลาย ตอนอายุ 18 ปี เขาได้พบ นัตสึนางะ นางิสะ ที่ไหว้วานให้ตามหาคนหนึ่งให้ ซึ่งเป็นเหตุให้เขาได้มีโอกาสคุยกับเซียสต้าอีกครั้ง' ,
        platformList:['netflix' ,'youtube' ,'iqiy'] ,
    } ,
    59985: { 
        season:'Season 4' ,
        subtitleList:[ 'ซับไทย','พากย์ไทย' ] ,
        resume:'เรื่องย่อ: เป็นเรื่องราวของ อิจิคาวะ เคียวทาโร่ เด็กหนุ่มที่มักจะคิดว่าตัวเองเป็นตัวเอกในนิยายระทึกขวัญ และมีแผนที่จะทำลายความสงบสุขของโรงเรียน รวมถึงไอดอลของชั้นอย่าง ยามาดะ อันนะ แต่สุดท้ายเขากลับพบว่าอันนะเองก็มีความแปลกประหลาดในแบบของเธอเช่นกัน' ,
        platformList:['netflix' ,'youtube'] ,
    }, 
    62729: {
        season: 'Movie',
        subtitleList: ['ซับไทย'],
        resume: 'เรื่องย่อ: การต่อสู้ครั้งใหญ่ระหว่างกลุ่มนักดาบที่มีพลังอำนาจมหาศาล เพื่อแย่งชิงความเป็นหนึ่งในยุทธภพ การต่อสู้ที่เต็มไปด้วยกลยุทธ์และพลังเหนือธรรมชาติ สร้างความตื่นเต้นและความประทับใจให้กับผู้ชม',
        platformList: ['bilibili'],
    },
    56876: {
        season: 'Season 2',
        subtitleList: ['ซับไทย', 'พากย์ไทย', 'พากย์ญี่ปุ่น'],
        resume: 'เรื่องย่อ: ภาคที่ 2 ของอนิเมะเรื่องนี้จะดำเนินเรื่องต่อจากภาคแรก โดยเน้นไปที่ความสัมพันธ์ที่เติบโตขึ้นระหว่าง Amane Fujimiya และ Mahiru Shiina ที่เริ่มมีความรู้สึกพิเศษต่อกันมากขึ้น เรื่องราวจะเน้นไปที่การพัฒนาความสัมพันธ์ของทั้งคู่ และการเผชิญหน้ากับอุปสรรคต่าง ๆ ที่เข้ามาในชีวิตประจำวันของพวกเขา',
        platformList: ['netflix', 'youtube', 'iqiy'],
    },
    60310: {
        season: 'Season 4',
        subtitleList: ['ซับไทย', 'พากย์ไทย', 'พากย์ญี่ปุ่น'],
        resume: 'เรื่องย่อ: Iruma Suzuki, เด็กหนุ่มมนุษย์ที่ถูกขายให้กับปีศาจและได้รับการเลี้ยงดูโดยปู่ปีศาจผู้เป็นประธานโรงเรียน Babyls, ยังคงเผชิญกับการผจญภัยในโลกของปีศาจ พร้อมกับเพื่อนๆ ที่มีความสามารถพิเศษและบุคลิกที่หลากหลาย ซีซั่นนี้จะเน้นไปที่การแข่งขัน Music Festival Arc ซึ่งเป็นหนึ่งในเหตุการณ์สำคัญในโลกของปีศาจ',
        platformList: ['netflix', 'youtube', 'iqiy'],
    },
    61186: {
        season: 'Season 1',
        subtitleList: ['ซับไทย', 'พากย์ไทย', 'พากย์ญี่ปุ่น'],
        resume: 'เรื่องย่อ: Botan Kamiina เป็นนักศึกษามหาวิทยาลัยวัย 20 ปีที่อาศัยอยู่ในเมือง Chichibu, Saitama ในงานปาร์ตี้ต้อนรับที่หอพัก เธอได้พบกับ Ibuki Tonami หัวหน้าหอที่ให้เครื่องดื่มแอลกอฮอล์แก่เธอ ทำให้ Botan รู้สึกเมาและเริ่มมีความกล้าแสดงออกมากขึ้น ความสัมพันธ์ระหว่างทั้งสองจึงเริ่มต้นขึ้นในลักษณะของคอมเมดี้ที่มีความน่ารักและอบอุ่น',
         platformList: ['netflix', 'youtube', 'iqiy'],
    },
    61153: {
        season: 'Season 1 (กำหนดฉาย: เมษายน 2026)',
        subtitleList: ['ซับไทย', 'พากย์ไทย', 'พากย์ญี่ปุ่น'],
        resume: 'หญิงสาวที่เกิดใหม่ในโลกแฟนตาซีและพยายามซ่อนตัวตนที่แท้จริงของเธอ',
        platformList: ['netflix', 'youtube', 'iqiy'],
    },
    62844: {
        season: 'Movie (กำหนดฉาย: 2025)',
        subtitleList: ['ซับไทย', 'พากย์ไทย', 'พากย์ญี่ปุ่น'],
        resume: 'เรื่องราวของหญิงสาวที่มีความสามารถพิเศษในการวิเคราะห์ยาที่ถูกใช้ในสมัยโบราณ เพื่อแก้ไขปัญหาที่เกิดขึ้นในสังคม',
        platformList: ['netflix', 'youtube', 'iqiy'],
    },
    62508: {
        season: 'Movie (กำหนดฉาย: 2025)',
        subtitleList: ['ซับไทย', 'พากย์ไทย', 'พากย์ญี่ปุ่น'],
        resume: 'การผจญภัยของโนบิตะและเพื่อนๆ ในโลกใต้ทะเลที่เต็มไปด้วยความลับและอันตราย',
        platformList: ['netflix', 'youtube', 'iqiy'],
    },
} as const;


